#include <stdio.h>

#include "menu.h"


void menu() {
    printf("\033[1;35m\n╔══════════════════════════════╗\n");
    printf("║     (｡>﹏<｡)💞 朋友管理系统 💞     ║\n");
    printf("╠══════════════════════════════╣\n");
    printf("\033[0;37m║  1. 添加新的小伙伴~            ║\n");
    printf("║  2. 删除离开的朋友...          ║\n");
    printf("║  3. 查找某位可爱的朋友         ║\n");
    printf("║  4. 列出全部好朋友！           ║\n");
    printf("║  5. 退出系统…再见呜呜~         ║\n");
    printf("\033[1;35m╚══════════════════════════════╝\033[0m\n");
    printf("💬 请选择操作: ");
}

